function CommonQuestions() {
  return (
    <div className="container py-14">
      <div className="flex items-center justify-center">
        <img
          loading="lazy"
          src="/images/commonQ.jpg"
          className="w-96"
          alt="قوانین-و-مقررات"
        />
      </div>
      <h5 className="my-5 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
        آیا می‌توانم بدون ثبت ‌نام یا داشتن حساب کاربری در فروشگاه الیزه شاپ
        سفارش خود را ثبت کنم؟
      </h5>
      <div className="font-vazirMedium leading-9 text-stone-500 dark:text-stone-400">
        خیر برای ثبت سفارش لازم است بر روی سایت، یک حساب کاربری داشته باشید.
        ایجاد حساب کاربری بر روی سایت الیزه شاپ بسیار ساده می ‌باشد.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          نحوه ثبت نام در سایت الیزه شاپ چگونه است؟{' '}
        </div>
        کلیه ی اصول و قواعد در فروشگاه اینترنتی الیزه شاپابتدا شماره موبایل خود
        را در قسمت ثبت نام وارد کنید و دکمه ثبت نام را بزنید. کد تاییدی که به
        شماره موبایل شما فرستاده می شود را وارد کنید و دکمه ورود را بزنید.{' '}
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          چگونه میتوانیم سوابق خرید و سفارشاتمان را در پروفایل مشاهده کنیم؟{' '}
        </div>
        در قسمت بالای صفحه روی علامت پروفایل کلیک کنید و فهرست سفارش ها رو
        انتخاب کنید. <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          آیا امکان ویرایش مشخصات کاربری و ایمیل من وجود دارد ؟
        </div>
        شما می توانید مشخصات کاربری خود را ویرایش کنید. برای این کار با وارد شدن
        به پنل "مشخصات فردی" میتوانید مشخصات خود را ویرایش نمایید.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          نحوه ی سفارش و خرید محصول از الیزه شاپ به چه صورت است؟
        </div>
        برای خرید از الیزه شاپ پس از ایجاد حساب کاربری یا ورود به حساب کاربری
        خود، کالای مورد نظر خود را به سبد خرید اضافه نمایید، سپس برای تکمیل
        سفارش، اطلاعات گیرنده سفارش و آدرس خود را وارد‌ نمایید، پس از انتخاب روش
        ارسال، نحوه پرداخت خود را انتخاب نمایید و سفارش خود را تکمیل کنید.{' '}
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          آیا در تمام ساعات شبانه روز می‌ توانم سفارش خود را ثبت کنم؟
        </div>
        بله در 24 ساعت شبانه روز و 7 روز هفته می‌ توانید سفارش خود را ثبت‌
        نمایید، توجه داشته باشید سفارش‌هایی که در ساعات و روز‌های غیر‌کاری ثبت
        می‌شوند، در اولین روز کاری بعدی بر اساس الویت مورد پردازش قرار می‌گیرند.
      </div>
    </div>
  );
}

export default CommonQuestions;
