function Privacy() {
  return (
    <div className="container py-14">
      <div className="flex items-center justify-center">
        <img src="/images/privacy.png" className="w-96" alt="حریم-خصوصی" />
      </div>
      <h5 className="font-vazirBold my-5 text-lg text-stone-600 dark:text-stone-300">
        رعایت حریم خصوصی در وب سایت الیزه شاپ
      </h5>
      <p className="font-vazirMedium leading-9 text-stone-500 dark:text-stone-400">
        کلیه ی فعالیت های ما در الیزه شاپ قانونی و مبتنی بر قوانین تجارت
        الکترونیک جمهوری اسلامی ایران صورت می گیرد.
        <br />
        ضمن احترام به حریم شخصی مشتریان، برای انجام خدماتی درست و مطمئن مانند
        خرید، مشاوره و یا استفاده از امکاناتی مثل اطلاع رسانی در مورد محصولات
        جدید و... اطلاعاتی از کاربران دریافت می نماییم. این اطلاعات جز با حکم
        قانونی و به مراجع ذی صلاح، در اختیار هیچ کس قرار نخواهد گرفت.
        <br />
        ما در هنگام خرید برای پردازش و ارسال سفارش ها، اطلاعاتی مانند آدرس،
        شماره تلفن و ایمیل را دریافت میکنیم.
        <br />
        بعلاوه ممکن است برای ارتباط با مشتریان، بهینه سازی محتوای سایت و یا
        تحقیقات بازاریابی از برخی از اطلاعات استفاده شده و برای مشتریان خود
        پیامک و یا ایمیل ارسال نماییم تا در جریان آخرین اخبار جشنواره و محصولات
        و .... قرار بگیرند.
        <br />
        بدیهی است امکان قطع این خبررسانی در صورت عدم علاقه ی مشتریان پس از اطلاع
        دادن به پشتیبانی سایت الیزه شاپ وجود دارد.
        <br />
        امیدواریم تجربه ی امن و راحتی در هنگام خرید از سایت ما داشته باشید.
      </p>
    </div>
  );
}

export default Privacy;
