function Terms() {
  return (
    <div className="container py-14">
      <div className="flex items-center justify-center">
        <img
          loading="lazy"
          src="/images/terms.png"
          className="w-96"
          alt="قوانین-و-مقررات"
        />
      </div>
      <h5 className="my-5 font-vazirBold text-xl text-stone-600 dark:text-stone-300">
        قوانین و مقررات فروشگاه الیزه شاپ
      </h5>
      <div className="font-vazirMedium leading-9 text-stone-500 dark:text-stone-400">
        از اینکه ما را برای دریافت خدمات و کالای مورد نیاز خود انتخاب کرده اید
        از شما سپاسگزاریم. بهتر است توجه نمائید که ورود هر کاربر به سایت الیزه
        شاپ و ثبت سفارش در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین
        فروشگاه اینترنتی الیزه شاپ از سوی کاربر است.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          قوانین عمومی{' '}
        </div>
        کلیه ی اصول و قواعد در فروشگاه اینترنتی الیزه شاپ منطبق با قوانین جمهوری
        اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است
        و قاعدتا موظف به رعایت قوانین مرتبط با کاربر است. در صورت هر تغییری در
        آینده، موارد در همین صفحه منتشر می گردد و شما توافق می کنید که استفاده
        مستمر شما از این فروشگاه اینترنتی به معنی پذیرش هرگونه تغییر است.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          تعریف مشتری یا کاربر{' '}
        </div>
        مشتری یا کاربر به شخصی گفته می شود که به سایت مراجعه کرده و اطلاعات خود
        را در فرم ثبت نام وارد نموده است، تا به ثبت سفارش و یا هرگونه استفاده از
        خدمات فروشگاهی اینترنتی الیزه شاپ پرداخته باشد.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          سیاست های رعایت حریم شخصی
        </div>
        فروشگاه اینترنتی الیزه شاپ، در حفظ اطلاعات هر کاربر کوشاست و هیچگونه
        اطلاعاتی از کاربران را در اختیار اشخاص دیگر قرار نمیدهد. به طور مفصل در
        قسمت حریم خصوصی به آن پرداخته ایم.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          حق نشر
        </div>
        همه ی مطالب در دسترس از طریق سایت اعم از لوگو، علائم تجاری، متن و .....
        و کلیه ی محتواهای تولید شده توسط الیزه شاپ جزئی از اموال فروشگاه
        اینترنتی الیزه شاپ به حساب می آید. حق استفاده و نشر تمامی مطالب موجود و
        در دسترس، انحصارا در اختیار الیزه شاپ است و هرگونه استفاده بدون کسب مجوز
        کتبی، برای الیزه شاپ حق پیگرد قانونی دارد.
        <br />
        <div className="my-2 font-vazirBold text-lg text-stone-600 dark:text-stone-300">
          ثبت، پردازش و ارسال سفارش
        </div>
        روز کاری به معنی هر روز هفته به غیر از جمعه و تعطیلات عمومی در ایران است
        و تمام سفارش های ثبت شده در طول روزهای کاری و اولین روز پس از تعطیلات
        پردازش می شوند.
        <br /> هر کاربر می تواند سفارش خود را در 7 روز هفته و در تمام 24 ساعت
        ثبت نماید. ساعات پاسخگویی از ساعت 10 صبح الی 17 بعد از ظهر روزهای کاری
        است و امکان پیگیری و ارسال سفارشات وجود دارد.
        <br /> اگر بعد از ثبت سفارش موجودی آن در فروشگاه الیزه شاپ به پایان
        رسید، حق کنسل کردن و یا استرداد هزینه ی آن برای الیزه شاپ محفوظ است.
        <br /> فروشگاه اینترنتی الیزه شاپ مجاز است بدون اطلاع قبلی نسبت به توقف
        سفارش‌ گیری جدید، اقدام و فروش خود را متوقف کند و کلیه سفارش های ثبت شده
        قبل از توقف سفارش گیری، پردازش و ارسال می شود.
        <br /> حق قطع فروش کلیه و یا بخشی از محصولات به هر دلیلی مانند اتمام
        موجودی کالا بدون اطلاع قبلی، برای فروشگاه اینترنتی الیزه شاپ محفوظ است.
      </div>
    </div>
  );
}

export default Terms;
